<?php

function fungenpass()
{
    $number = 7;

    $arr = array('a','b','c','d','e','f',

        'g','h','i','j','k','l',

        'm','n','o','p','r','s',

        't','u','v','x','y','z',

        '1','2','3','4','5','6',

        '7','8','9','0');

    // Генерируем пароль

    $pass = "";

    for($i = 0; $i < $number; $i++)

    {

        // Вычисляем случайный индекс массива

        $index = rand(0, count($arr) - 1);

        $pass .= $arr[$index];

    }


    return $pass;
}




function ftranslite($name){

    $name=preg_replace("/[\s+\.\,]/","-",$name);
    $name=preg_replace("/[\"\'\!\?\(\)\:\$\%]/","",$name);

    static $trans= array(
        'а'=>'a', 'б'=>'b', 'в'=>'v', 'г'=>'g', 'д'=>'d', 'е'=>'e', 'ж'=>'zh', 'з'=>'z',
        'и'=>'i', 'й'=>'y', 'к'=>'k', 'л'=>'l', 'м'=>'m', 'н'=>'n', 'о'=>'o', 'п'=>'p',
        'р'=>'r', 'с'=>'s', 'т'=>'t', 'у'=>'u', 'ф'=>'f', 'ы'=>'i', 'э'=>'e', 'А'=>'A',
        'Б'=>'B', 'В'=>'V', 'Г'=>'G', 'Д'=>'D', 'Е'=>'E', 'Ж'=>'ZH', 'З'=>'Z', 'И'=>'I',
        'Й'=>'Y', 'К'=>'K', 'Л'=>'L', 'М'=>'M', 'Н'=>'N', 'О'=>'O', 'П'=>'P', 'Р'=>'R',
        'С'=>'S', 'Т'=>'T', 'У'=>'U', 'Ф'=>'F', 'Ы'=>'I', 'Э'=>'E', 'ё'=>"yo", 'х'=>"h",
        'ц'=>"ts", 'ч'=>"ch", 'ш'=>"sh", 'щ'=>"shch", 'ъ'=>"", 'ь'=>"", 'ю'=>"yu", 'я'=>"ya",
        'Ё'=>"YO", 'Х'=>"H", 'Ц'=>"TS", 'Ч'=>"CH", 'Ш'=>"SH", 'Щ'=>"SHCH", 'Ъ'=>"", 'Ь'=>"",
        'Ю'=>"YU", 'Я'=>"YA"
    );

    $strstring = strtr($name, $trans) ;

    return strtolower($strstring) ;
}


?>
<script href=""></script>
